In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"]=(20,10)

In [2]:
df1 = pd.read_csv("Bengaluru_House_Data.csv")

#it will display first 5 rows of dataset
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [3]:
#it will find total numbers of rows and columns in given dataset
df1.shape

(13320, 9)

In [4]:
'''
1. df1.groupby('area_type'): Groups the DataFrame df1 by the values in the area_type column.

2. ['area_type']: Selects the area_type column from the grouped data.

3. .agg('count'): Applies the aggregation function count to compute the number of non-NA/null entries for each group.

The result is a Series where the index is the unique values of area_type, and the values are the counts of occurrences for each area_type.'''

df1.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [5]:
#this will remove the given column name from dataset
df2 = df1.drop(['area_type', 'society', 'balcony', 'availability'], axis='columns')

df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [6]:
#this will find the total number of null value present in each column
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [7]:
#now drop the row which have null value using below function

df3 = df2.dropna()

df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [8]:
df3.shape

(13246, 5)

In [9]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [10]:
#here u can see size of the flat, but there is one problem like, 4 bhk and 4 bedroom are same. so we here we can create a new column to store the value of flat size value

'''
Below line of code creates a new column `bhk` in the `df3` DataFrame by extracting the first number from the `size` column. Here's what each part does:

1. **`df3['size']`**: Accesses the `size` column of the DataFrame `df3`.

2. **`.apply(lambda x: int(x.split(' ')[0]))`**:
   - **`lambda x:`**: Defines an anonymous function to process each element in the `size` column.
   - **`x.split(' ')[0]`**: Splits the string `x` on spaces and takes the first part (typically the number indicating the BHK).
   - **`int(...)`**: Converts the extracted string to an integer.

3. **`df3['bhk'] = ...`**: Assigns the resulting values as a new column named `bhk` in `df3`.

### Example:
If `df3['size']` contains values like `2 BHK` or `3 Bedroom`, the `bhk` column will contain `2` and `3`, respectively.

'''

df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

df3.head()

C:\Users\Admin\AppData\Local\Temp\ipykernel_5096\484841954.py:20: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [11]:
df3['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [12]:
df3[df3.bhk>20]

#we can see in output, the size of flat is 43 BHK and the total_sqft is only 2400 that is not possible so we can remove these kind of values

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [13]:
df3.total_sqft.unique()

#in output we can see the value is in range. so first we have to give average value for this type of value
# so for that we can create below function

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [14]:
'''
The `is_float` function checks if a given input `x` can be converted to a float. Here's what it does:

1. **`try:`**: Attempts to convert `x` to a float.
2. **`float(x)`**: Tries to convert the input `x` to a float. If successful, the function proceeds without an error.
3. **`except:`**: If an error occurs (e.g., if `x` cannot be converted to a float), the function catches it and returns `False`.
4. **`return True`**: If no error occurs, the function returns `True`, indicating that `x` can be converted to a float.

### Usage Example:
```python
print(is_float("3.14"))  # True
print(is_float("abc"))   # False
print(is_float("10"))    # True
print(is_float(""))      # False
```

'''

def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [15]:
df3[~df3['total_sqft'].apply(is_float)].head()

#here we can see range value so we will provide average value for that ranges

               location   size   total_sqft  bath    price  bhk
30            Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122              Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165            Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188            KR Puram  2 BHK  1015 - 1540   2.0   56.800    2

In [16]:
'''
The `convert_sqft_to_num` function converts a given string representing square footage into a numeric value. It handles different formats of input gracefully.

### Explanation:

1. **`token = x.split('-')`**: Splits the input string `x` into parts wherever a hyphen (`-`) appears. For example:
   - `"1200-1500"` becomes `['1200', '1500']`.

2. **`if len(token) == 2:`**: Checks if the input contains exactly two parts (indicating a range of values like `1200-1500`).
   - **`return (float(token[0]) + float(token[1])) / 2`**: Calculates the average of the two numbers in the range.

3. **`try:`**: Attempts to directly convert the input `x` to a float if it is a single value (e.g., `1200`).

4. **`return float(x)`**: Returns the float value if the conversion is successful.

5. **`except:`**: If the conversion fails (e.g., if the input is not numeric or in an unexpected format), the function returns `None`.

### Usage Example:
```python
print(convert_sqft_to_num("1200-1500"))  # 1350.0 (average of 1200 and 1500)
print(convert_sqft_to_num("1200"))       # 1200.0
print(convert_sqft_to_num("abc"))        # None
```
'''
def convert_sqft_to_num(x):
    token = x.split('-')
    if len(token) == 2:
        return (float(token[0])+float(token[1]))/2
    try:
        return float(x)
    except:
        return None

In [17]:
df4 =df3.copy()
df4['total_sqft'] = df4['total_sqft'].apply(convert_sqft_to_num)

df4.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [18]:
df5=df4.copy()

'''
This line of code calculates the price per square foot for each property in the `df5` DataFrame and stores the result in a new column 
called `price_per_sqft`. Here's what each part does:

1. **`df5['price']`**: Accesses the `price` column in the DataFrame, which contains the price of each property in lakhs (100,000 units).

2. **`* 100000`**: Converts the price from lakhs to its actual value.

3. **`/ df5['total_sqft']`**: Divides the total price by the total square footage (`total_sqft`) for each property to compute the price per square foot.

4. **`df5['price_per_sqft'] = ...`**: Stores the computed values in a new column named `price_per_sqft` in the `df5` DataFrame.

### Example:
If a property has:
- `price` = 50 (in lakhs)
- `total_sqft` = 1000

The `price_per_sqft` will be:
```python
price_per_sqft = (50 * 100000) / 1000 = 5000
```
'''
df5['price_per_sqft'] = df5['price']*100000/df5['total_sqft']
df5.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [ ]:
'''
The code `len(df5.location.unique())` calculates the number of unique locations in the `location` column of the `df5` DataFrame. Here's what it does:

1. **`df5.location`**: Accesses the `location` column of the DataFrame.

2. **`.unique()`**: Returns an array of all unique values in the `location` column, removing duplicates.

3. **`len(...)`**: Calculates the length of the array, giving the total count of unique locations.

### Example:
If the `location` column contains:
`['A', 'B', 'A', 'C', 'B']`

- `.unique()` will return `['A', 'B', 'C']`
- `len(...)` will return `3`. 

This gives the total number of unique locations in the column.
'''
len(df5.location.unique())

1304

In [23]:
'''
This code processes the `location` column in the `df5` DataFrame and generates a sorted count of occurrences for each unique location.

1. **`df5.location.apply(lambda x: x.strip())`**:
   - Removes any leading or trailing whitespace from each value in the `location` column.
   - This ensures that locations with extra spaces (e.g., `" New York "` vs. `"New York"`) are treated as the same value.

2. **`location_stats = df5.groupby('location')['location']`**:
   - Groups the DataFrame by the `location` column, organizing rows by unique location values.

3. **`.agg('count')`**:
   - Counts the number of occurrences of each unique location in the `location` column.

4. **`.sort_values(ascending=False)`**:
   - Sorts the resulting counts in descending order so that the most frequently occurring locations appear first.

### Output:
`location_stats` is a Series where:
- The index represents unique locations.
- The values represent the counts of those locations, sorted in descending order. 

Example:
If `df5.location` contains:
`['New York', 'New York', 'Los Angeles', ' Chicago ', 'Chicago']`

The output will be:
```
New York       2
Chicago        2
Los Angeles    1
```
'''
df5.location = df5.location.apply(lambda x: x.strip())

location_stats = df5.groupby('location')['location'].agg('count').sort_values(ascending=False)
location_stats

location
Whitefield               535
Sarjapur  Road           392
Electronic City          304
Kanakpura Road           266
Thanisandra              236
                        ...
1 Giri Nagar               1
Kanakapura Road,           1
Kanakapura main  Road      1
Karnataka Shabarimala      1
whitefiled                 1
Name: location, Length: 1293, dtype: int64

In [ ]:
len(location_stats[location_stats<=10])

1052

In [27]:
location_stats_less_than_10 = location_stats[location_stats<=10]
location_stats_less_than_10

location
Basapura                 10
1st Block Koramangala    10
Gunjur Palya             10
Kalkere                  10
Sector 1 HSR Layout      10
                         ..
1 Giri Nagar              1
Kanakapura Road,          1
Kanakapura main  Road     1
Karnataka Shabarimala     1
whitefiled                1
Name: location, Length: 1052, dtype: int64

In [28]:
len(df5.location.unique())

1293

In [31]:
df5.location = df5.location.apply(lambda x: 'other' if x in location_stats_less_than_10 else x)
len(df5.location.unique())
df5.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000